Revit 2027 API
FilterInverseRule Constructor
 Constructs a new instance of FilterInverseRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilterInverseRule(
	FilterRule innerRule
)
Public Sub New (
	innerRule As FilterRule
)
public:
FilterInverseRule(
	FilterRule^ innerRule
)
new :
        innerRule : FilterRule -> FilterInverseRule
Parameters
innerRule FilterRule
 The rule to invert.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterInverseRule Class
Autodesk.Revit.DB Namespace